flat_plate_ext_graded/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    zeroGradientPlanes
    {
        type            patch;
        nFaces          190;
        startFace       13830;
    }
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       14020;
    }
    plate
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       14120;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          14000;
        startFace       14170;
    }
)

// ************************************************************************* //
